In [12]:
import pandas
import numpy
titanic_survival = pandas.read_csv("E:\Workspace\jupyter_notebook\\notebook_idata_lesson01\pandas\\titanic_train.csv")
titanic_survival.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>PassengerId</th>
      <th>Survived</th>
      <th>Pclass</th>
      <th>Name</th>
      <th>Sex</th>
      <th>Age</th>
      <th>SibSp</th>
      <th>Parch</th>
      <th>Ticket</th>
      <th>Fare</th>
      <th>Cabin</th>
      <th>Embarked</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>0</td>
      <td>3</td>
      <td>Braund, Mr. Owen Harris</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>A/5 21171</td>
      <td>7.2500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>1</td>
      <td>1</td>
      <td>Cumings, Mrs. John Bradley (Florence Briggs Th...</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>PC 17599</td>
      <td>71.2833</td>
      <td>C85</td>
      <td>C</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>1</td>
      <td>3</td>
      <td>Heikkinen, Miss. Laina</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>STON/O2. 3101282</td>
      <td>7.9250</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>1</td>
      <td>1</td>
      <td>Futrelle, Mrs. Jacques Heath (Lily May Peel)</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>113803</td>
      <td>53.1000</td>
      <td>C123</td>
      <td>S</td>
    </tr>
    <tr>
      <th>4</th>
      <td>5</td>
      <td>0</td>
      <td>3</td>
      <td>Allen, Mr. William Henry</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>373450</td>
      <td>8.0500</td>
      <td>NaN</td>
      <td>S</td>
    </tr>
  </tbody>
</table>
</div>

In [3]:
# 求平均年龄
mean_age = sum(titanic_survival["Age"]) / len(titanic_survival["Age"])
print(mean_age)
# 这里会计算出Nan是因为，Age列里面含有Nan值，那么这样子计算的话就会得到Nan

nan

In [9]:
# 筛选出Age列不是Nan的
good_ages = titanic_survival[~pandas.isnull(titanic_survival["Age"])]
# 计算good_ages里面的平均年龄
mean_age = sum(good_ages["Age"]) / len(good_ages["Age"])
print(mean_age)

29.6991176471

In [10]:
# 更简便的计算平均年龄的方法，直接在列上调用mean()
mean_age = titanic_survival["Age"].mean()
print(mean_age)

29.69911764705882

In [11]:
# 计算每个舱等的平均票价，使用for循环的方式
passenger_classes = [1, 2, 3]
fares_by_class = {}
for this_class in passenger_classes:
    # 筛选出是这个舱等的行
    pclass_rows = titanic_survival[titanic_survival["Pclass"] == this_class]
    fare_this_class = pclass_rows["Fare"].mean()
    fares_by_class[this_class] = fare_this_class
print(fares_by_class)

{1: 84.15468749999992, 2: 20.66218315217391, 3: 13.675550101832997}

In [14]:
# 计算Pclass和Survived之间的关系
# 使用数据透视表
# index表示统计的东西是以哪列为基准的，比如这个里面统计在每个Pclass舱等里面，有多少生还的
# values就是，要统计index和哪些列之间的关系
passenger_survival = titanic_survival.pivot_table(index="Pclass", values="Survived", aggfunc=numpy.mean)
print(passenger_survival)

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [17]:
# 计算Pclass和Age之间的关系
passenger_age = titanic_survival.pivot_table(index="Pclass", values="Age", aggfunc=numpy.mean)
print(passenger_age)

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [18]:
# 计算Embarked和两个列之间的关系,Fare和Survived
port_stats = titanic_survival.pivot_table(index="Embarked", values=["Fare", "Survived"], aggfunc=numpy.sum)
print(port_stats)

                Fare  Survived
Embarked
C         10072.2962        93
Q          1022.2543        30
S         17439.3988       217

In [23]:
# dropna
# 只要这一列有Nan值，就把这列删除，axis的时候，是对列做操作
print(titanic_survival.shape)
drop_na_columns = titanic_survival.dropna(axis=1)
print(drop_na_columns.shape)
# 删除行，要是Age或者Sex两列的值有为Nan的，就把那行删除
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["Age", "Sex"])
print(new_titanic_survival.shape)

(891, 12)
(891, 9)
(714, 12)

In [26]:
# 通过行列得到确切的值，要使用loc
row_index_83_age = titanic_survival.loc[83, "Age"]
print(row_index_83_age)
row_index_500_pclass = titanic_survival.loc[500, "Pclass"]
print(row_index_500_pclass)

28.0
3